---
kind: method
id: M:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique(System.String)
source: html/21117b1f-1cb9-e298-10b5-2425755b425a.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique Method

Determines whether a potential building type name is unique.

## Syntax (C#)
```csharp
public bool IsNameUnique(
	string name
)
```

## Parameters
- **name** (`System.String`) - The candidate name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null